Archive/taurus-url-load-test.yml
---
settings:
  default-executor: jmeter

execution:
  - scenario: repeated-url-hit
    concurrency: 100
    hold-for: 15m

scenarios:
  repeated-url-hit:
    requests:
      - url: http://vpc-as-Appli-IkJAXolgzBiI-1863216186.us-east-1.elb.amazonaws.com/
        method: GET
        label: target-url-request

reporting:
  - module: final-stats